
# State **`s3://infrahouse-github-state/github.state`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       4 |          1 |           1 |
## Affected resources by action

|  Action  | Resources                                                                              |
|:--------:|:---------------------------------------------------------------------------------------|
|    🟢     | `module.ih_8_repos["aws-control"].github_actions_secret.role["AWS_DEFAULT_REGION"]`    |
|    🟢     | `module.ih_8_repos["aws-s3-control"].github_actions_secret.role["AWS_DEFAULT_REGION"]` |
|    🟢     | `module.ih_8_repos["github-control"].github_actions_secret.role["AWS_DEFAULT_REGION"]` |
|    🟢     | `github_repository.terraform-template:`                                                |
|    🟡     | `module.ih_8_repos["github-control"].github_repository.repo`                           |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/cafc2017-24fb-4f87-974e-a13e77a9982e/terraform-bin plan -var-file=configuration.tfvars --out=tf.plan
github_repository.terraform-template: Refreshing state... [id=terraform-template]
module.ih_8_repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]
module.ih_8_repos["aws-s3-control"].github_repository.repo: Refreshing state... [id=aws-s3-control]
module.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
github_team.dev: Refreshing state... [id=7332815]
github_team_members.dev: Refreshing state... [id=7332815]
module.repos["infrahouse-aws-control"].github_repository.repo: Refreshing state... [id=infrahouse-aws-control]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
module.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]
module.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]
module.ih_8_repos["aws-control"].github_branch_default.main: Refreshing state... [id=aws-control]
module.ih_8_repos["aws-s3-control"].github_branch_default.main: Refreshing state... [id=aws-s3-control]
module.ih_8_repos["aws-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-control:akuzminsky]
module.ih_8_repos["aws-s3-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-s3-control:akuzminsky]
module.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]
module.ih_8_repos["aws-s3-control"].github_actions_secret.role["AWS_ROLE"]: Refreshing state... [id=aws-s3-control:AWS_ROLE]
module.ih_8_repos["github-control"].github_actions_secret.role["AWS_ROLE"]: Refreshing state... [id=github-control:AWS_ROLE]
module.ih_8_repos["aws-s3-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCeiUc4CEZvQ]
module.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]
module.ih_8_repos["aws-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCxf584CEeam]
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_access_key_id: Reading...
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_secret_access_key: Reading...
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_access_key_id: Reading...
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_secret_access_key: Reading...
module.repos["infrahouse-aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-aws-control]
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_access_key_id: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_secret_access_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]
module.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_access_key_id: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]
data.aws_secretsmanager_secret_version.pypi_api_token: Reading...
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_secret_access_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_access_key_id: Reading...
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_access_key_id: Reading...
data.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_secret_access_key: Reading...
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_access_key_id: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_secret_access_key: Reading...
github_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_access_key_id: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_secret_access_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_secret_access_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]
github_actions_secret.aws_secret_access_key["infrahouse-aws-control"]: Refreshing state... [id=infrahouse-aws-control:AWS_SECRET_ACCESS_KEY]
github_actions_secret.aws_secret_access_key["infrahouse-website-infra"]: Refreshing state... [id=infrahouse-website-infra:AWS_SECRET_ACCESS_KEY]
github_actions_secret.aws_access_key_id["infrahouse-aws-control"]: Refreshing state... [id=infrahouse-aws-control:AWS_ACCESS_KEY_ID]
github_actions_secret.aws_access_key_id["infrahouse-website-infra"]: Refreshing state... [id=infrahouse-website-infra:AWS_ACCESS_KEY_ID]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ih_8_repos["aws-control"].github_actions_secret.role["AWS_DEFAULT_REGION"] will be created
  + resource "github_actions_secret" "role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-control"
      + secret_name     = "AWS_DEFAULT_REGION"
      + updated_at      = (known after apply)
    }

  # module.ih_8_repos["aws-s3-control"].github_actions_secret.role["AWS_DEFAULT_REGION"] will be created
  + resource "github_actions_secret" "role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-s3-control"
      + secret_name     = "AWS_DEFAULT_REGION"
      + updated_at      = (known after apply)
    }

  # module.ih_8_repos["aws-s3-control"].github_actions_secret.role["AWS_ROLE"] must be replaced
-/+ resource "github_actions_secret" "role" {
      ~ created_at      = "2023-03-19 22:30:50 +0000 UTC" -> (known after apply)
      ~ id              = "aws-s3-control:AWS_ROLE" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-19 22:30:50 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.ih_8_repos["github-control"].github_actions_secret.role["AWS_DEFAULT_REGION"] will be created
  + resource "github_actions_secret" "role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "github-control"
      + secret_name     = "AWS_DEFAULT_REGION"
      + updated_at      = (known after apply)
    }

  # module.ih_8_repos["github-control"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "github-control"
        name                        = "github-control"
        # (33 unchanged attributes hidden)

      + template {
          + include_all_branches = false
          + owner                = "infrahouse8"
          + repository           = "terraform-template"
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: github_repository.terraform-template: Refreshing state... [id=terraform-template]%0Amodule.ih_8_repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]%0Amodule.ih_8_repos["aws-s3-control"].github_repository.repo: Refreshing state... [id=aws-s3-control]%0Amodule.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]%0Agithub_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Agithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Amodule.repos["infrahouse-aws-control"].github_repository.repo: Refreshing state... [id=infrahouse-aws-control]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Amodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]%0Amodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["aws-control"].github_branch_default.main: Refreshing state... [id=aws-control]%0Amodule.ih_8_repos["aws-s3-control"].github_branch_default.main: Refreshing state... [id=aws-s3-control]%0Amodule.ih_8_repos["aws-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-control:akuzminsky]%0Amodule.ih_8_repos["aws-s3-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-s3-control:akuzminsky]%0Amodule.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]%0Amodule.ih_8_repos["aws-s3-control"].github_actions_secret.role["AWS_ROLE"]: Refreshing state... [id=aws-s3-control:AWS_ROLE]%0Amodule.ih_8_repos["github-control"].github_actions_secret.role["AWS_ROLE"]: Refreshing state... [id=github-control:AWS_ROLE]%0Amodule.ih_8_repos["aws-s3-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCeiUc4CEZvQ]%0Amodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]%0Amodule.ih_8_repos["aws-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCxf584CEeam]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_access_key_id: Reading...%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_secret_access_key: Reading...%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_access_key_id: Reading...%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_secret_access_key: Reading...%0Amodule.repos["infrahouse-aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-aws-control]%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_access_key_id: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_secret_access_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]%0Amodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_access_key_id: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_secret_access_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_access_key_id: Reading...%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_access_key_id: Reading...%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_secret_access_key: Reading...%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_access_key_id: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_secret_access_key: Reading...%0Agithub_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_access_key_id: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_secret_access_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_secret_access_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]%0Agithub_actions_secret.aws_secret_access_key["infrahouse-aws-control"]: Refreshing state... [id=infrahouse-aws-control:AWS_SECRET_ACCESS_KEY]%0Agithub_actions_secret.aws_secret_access_key["infrahouse-website-infra"]: Refreshing state... [id=infrahouse-website-infra:AWS_SECRET_ACCESS_KEY]%0Agithub_actions_secret.aws_access_key_id["infrahouse-aws-control"]: Refreshing state... [id=infrahouse-aws-control:AWS_ACCESS_KEY_ID]%0Agithub_actions_secret.aws_access_key_id["infrahouse-website-infra"]: Refreshing state... [id=infrahouse-website-infra:AWS_ACCESS_KEY_ID]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.ih_8_repos["aws-control"].github_actions_secret.role["AWS_DEFAULT_REGION"] will be created%0A  + resource "github_actions_secret" "role" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "aws-control"%0A      + secret_name     = "AWS_DEFAULT_REGION"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.ih_8_repos["aws-s3-control"].github_actions_secret.role["AWS_DEFAULT_REGION"] will be created%0A  + resource "github_actions_secret" "role" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "aws-s3-control"%0A      + secret_name     = "AWS_DEFAULT_REGION"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.ih_8_repos["aws-s3-control"].github_actions_secret.role["AWS_ROLE"] must be replaced%0A-/+ resource "github_actions_secret" "role" {%0A      ~ created_at      = "2023-03-19 22:30:50 +0000 UTC" -> (known after apply)%0A      ~ id              = "aws-s3-control:AWS_ROLE" -> (known after apply)%0A      ~ plaintext_value = (sensitive value) # forces replacement%0A      ~ updated_at      = "2023-03-19 22:30:50 +0000 UTC" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.ih_8_repos["github-control"].github_actions_secret.role["AWS_DEFAULT_REGION"] will be created%0A  + resource "github_actions_secret" "role" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "github-control"%0A      + secret_name     = "AWS_DEFAULT_REGION"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.ih_8_repos["github-control"].github_repository.repo will be updated in-place%0A  ~ resource "github_repository" "repo" {%0A        id                          = "github-control"%0A        name                        = "github-control"%0A        # (33 unchanged attributes hidden)%0A%0A      + template {%0A          + include_all_branches = false%0A          + owner                = "infrahouse8"%0A          + repository           = "terraform-template"%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0APlan: 4 to add, 1 to change, 1 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLXN0YXRlL2dpdGh1Yi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvY2FmYzIwMTctMjRmYi00Zjg3LTk3NGUtYTEzZTc3YTk5ODJlL3RlcnJhZm9ybS1iaW4gcGxhbiAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLS1vdXQ9dGYucGxhblxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3JlcG9zaXRvcnkudGVycmFmb3JtLXRlbXBsYXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tdGVtcGxhdGVdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfb3JnYW5pemF0aW9uX3NldHRpbmdzLmluZnJhaG91c2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTEyMTk4NDI2M11cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9tZW1iZXJzaGlwLmluZnJhaG91c2VbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlOmFrdXptaW5za3ldXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfdGVhbS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfdGVhbV9tZW1iZXJzLmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYnJhbmNoX2RlZmF1bHQubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnlfY29sbGFib3JhdG9yLmNvbGxhYm9yYXRvcnNbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpha3V6bWluc2t5XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeV9jb2xsYWJvcmF0b3IuY29sbGFib3JhdG9yc1tcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sOmFrdXptaW5za3ldXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6YWt1em1pbnNreV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnJvbGVbXCJBV1NfUk9MRVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2w6QVdTX1JPTEVdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5yb2xlW1wiQVdTX1JPTEVcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOkFXU19ST0xFXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9KQ2VpVWM0Q0VadlFdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0kydnU3TTRDQWljaV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9wcm90ZWN0aW9uLm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUJQUl9rd0RPSkN4ZjU4NENFZWFtXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5weXBpX2FwaV90b2tlbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19hY2Nlc3Nfa2V5X2lkOiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfc2VjcmV0X2FjY2Vzc19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3NfYWNjZXNzX2tleV9pZDogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19zZWNyZXRfYWNjZXNzX2tleTogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLWF3cy1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX2FjY2Vzc19rZXlfaWQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9hd3MtdVdKMUwyXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtdG9vbGtpdF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19zZWNyZXRfYWNjZXNzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2F3cy11V0oxTDJdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19hY2Nlc3Nfa2V5X2lkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfYXdzLXVXSjFMMl1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19zZWNyZXRfYWNjZXNzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2F3cy11V0oxTDJdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3NfYWNjZXNzX2tleV9pZDogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3NfYWNjZXNzX2tleV9pZDogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi1kaElJOVB8QVdTQ1VSUkVOVF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uYXdzX3NlY3JldF9hY2Nlc3Nfa2V5OiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3NfYWNjZXNzX2tleV9pZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2F3cy11V0oxTDJ8QVdTQ1VSUkVOVF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19zZWNyZXRfYWNjZXNzX2tleTogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnB5cGlfYXBpX3Rva2VuW1wiaW5mcmFob3VzZS10b29sa2l0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6UFlQSV9BUElfVE9LRU5dXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19hY2Nlc3Nfa2V5X2lkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfYXdzLXVXSjFMMnxBV1NDVVJSRU5UXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfc2VjcmV0X2FjY2Vzc19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9hd3MtdVdKMUwyfEFXU0NVUlJFTlRdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfc2VjcmV0X2FjY2Vzc19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9hd3MtdVdKMUwyfEFXU0NVUlJFTlRdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfYWN0aW9uc19zZWNyZXQuYXdzX3NlY3JldF9hY2Nlc3Nfa2V5W1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbDpBV1NfU0VDUkVUX0FDQ0VTU19LRVldXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfYWN0aW9uc19zZWNyZXQuYXdzX3NlY3JldF9hY2Nlc3Nfa2V5W1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmE6QVdTX1NFQ1JFVF9BQ0NFU1NfS0VZXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX2FjdGlvbnNfc2VjcmV0LmF3c19hY2Nlc3Nfa2V5X2lkW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbDpBV1NfQUNDRVNTX0tFWV9JRF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9hY3Rpb25zX3NlY3JldC5hd3NfYWNjZXNzX2tleV9pZFtcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkFXU19BQ0NFU1NfS0VZX0lEXVx1MDAxYlswbVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gIFx1MDAxYlszMm0rXHUwMDFiWzBtIGNyZWF0ZVx1MDAxYlswbVxuICBcdTAwMWJbMzNtflx1MDAxYlswbSB1cGRhdGUgaW4tcGxhY2VcdTAwMWJbMG1cblx1MDAxYlszMW0tXHUwMDFiWzBtL1x1MDAxYlszMm0rXHUwMDFiWzBtIGRlc3Ryb3kgYW5kIHRoZW4gY3JlYXRlIHJlcGxhY2VtZW50XHUwMDFiWzBtXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQucm9sZVtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXVx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcblx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInJvbGVcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSAgICAgID0gXCJhd3MtY29udHJvbFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfbmFtZSAgICAgPSBcIkFXU19ERUZBVUxUX1JFR0lPTlwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQucm9sZVtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXVx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcblx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInJvbGVcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSAgICAgID0gXCJhd3MtczMtY29udHJvbFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfbmFtZSAgICAgPSBcIkFXU19ERUZBVUxUX1JFR0lPTlwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQucm9sZVtcIkFXU19ST0xFXCJdXHUwMDFiWzBtIG11c3QgYmUgXHUwMDFiWzFtXHUwMDFiWzMxbXJlcGxhY2VkXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMzFtLVx1MDAxYlswbS9cdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwicm9sZVwiIHtcbiAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIGNyZWF0ZWRfYXQgICAgICA9IFwiMjAyMy0wMy0xOSAyMjozMDo1MCArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSBcImF3cy1zMy1jb250cm9sOkFXU19ST0xFXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSkgXHUwMDFiWzMxbSMgZm9yY2VzIHJlcGxhY2VtZW50XHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSB1cGRhdGVkX2F0ICAgICAgPSBcIjIwMjMtMDMtMTkgMjI6MzA6NTAgKzAwMDAgVVRDXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICBcdTAwMWJbOTBtIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQucm9sZVtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXVx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcblx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInJvbGVcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSAgICAgID0gXCJnaXRodWItY29udHJvbFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfbmFtZSAgICAgPSBcIkFXU19ERUZBVUxUX1JFR0lPTlwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvXHUwMDFiWzBtIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuXHUwMDFiWzBtICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImdpdGh1Yi1jb250cm9sXCJcbiAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJnaXRodWItY29udHJvbFwiXG4gICAgICAgIFx1MDAxYls5MG0jICgzMyB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtXG5cbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHRlbXBsYXRlIHtcbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpbmNsdWRlX2FsbF9icmFuY2hlcyA9IGZhbHNlXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gb3duZXIgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2U4XCJcbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXBvc2l0b3J5ICAgICAgICAgICA9IFwidGVycmFmb3JtLXRlbXBsYXRlXCJcbiAgICAgICAgfVxuXG4gICAgICAgIFx1MDAxYls5MG0jICgxIHVuY2hhbmdlZCBibG9jayBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgfVxuXG5cdTAwMWJbMW1QbGFuOlx1MDAxYlswbSA0IHRvIGFkZCwgMSB0byBjaGFuZ2UsIDEgdG8gZGVzdHJveS5cblx1MDAxYlswbVx1MDAxYls5MG1cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MDAxYlswbVxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IFx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9yZXBvc2l0b3J5LnRlcnJhZm9ybS10ZW1wbGF0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9vcmdhbml6YXRpb25fc2V0dGluZ3MuaW5mcmFob3VzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MTIxOTg0MjYzXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9tZW1iZXJzaGlwLmluZnJhaG91c2VbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlOmFrdXptaW5za3ldXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW0uZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2w6YWt1em1pbnNreV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2w6YWt1em1pbnNreV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6YWt1em1pbnNreV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5yb2xlW1wiQVdTX1JPTEVcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sOkFXU19ST0xFXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnJvbGVbXCJBV1NfUk9MRVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6QVdTX1JPTEVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9KQ2VpVWM0Q0VadlFdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9JMnZ1N000Q0FpY2ldXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9KQ3hmNTg0Q0VlYW1dXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5weXBpX2FwaV90b2tlbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3NfYWNjZXNzX2tleV9pZDogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19zZWNyZXRfYWNjZXNzX2tleTogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3NfYWNjZXNzX2tleV9pZDogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfc2VjcmV0X2FjY2Vzc19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtYXdzLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX2FjY2Vzc19rZXlfaWQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9hd3MtdVdKMUwyXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX3NlY3JldF9hY2Nlc3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfYXdzLXVXSjFMMl1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3NfYWNjZXNzX2tleV9pZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2F3cy11V0oxTDJdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfc2VjcmV0X2FjY2Vzc19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9hd3MtdVdKMUwyXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19hY2Nlc3Nfa2V5X2lkOiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3NfYWNjZXNzX2tleV9pZDogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tZGhJSTlQfEFXU0NVUlJFTlRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfc2VjcmV0X2FjY2Vzc19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3NfYWNjZXNzX2tleV9pZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2F3cy11V0oxTDJ8QVdTQ1VSUkVOVF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfc2VjcmV0X2FjY2Vzc19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfYWN0aW9uc19zZWNyZXQucHlwaV9hcGlfdG9rZW5bXCJpbmZyYWhvdXNlLXRvb2xraXRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpQWVBJX0FQSV9UT0tFTl1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19hY2Nlc3Nfa2V5X2lkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfYXdzLXVXSjFMMnxBV1NDVVJSRU5UXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uYXdzX3NlY3JldF9hY2Nlc3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfYXdzLXVXSjFMMnxBV1NDVVJSRU5UXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19zZWNyZXRfYWNjZXNzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2F3cy11V0oxTDJ8QVdTQ1VSUkVOVF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfYWN0aW9uc19zZWNyZXQuYXdzX3NlY3JldF9hY2Nlc3Nfa2V5W1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbDpBV1NfU0VDUkVUX0FDQ0VTU19LRVldXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX2FjdGlvbnNfc2VjcmV0LmF3c19zZWNyZXRfYWNjZXNzX2tleVtcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkFXU19TRUNSRVRfQUNDRVNTX0tFWV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfYWN0aW9uc19zZWNyZXQuYXdzX2FjY2Vzc19rZXlfaWRbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sOkFXU19BQ0NFU1NfS0VZX0lEXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9hY3Rpb25zX3NlY3JldC5hd3NfYWNjZXNzX2tleV9pZFtcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkFXU19BQ0NFU1NfS0VZX0lEXVx1MDAxYlswbSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICBcdTAwMWJbMzJtK1x1MDAxYlswbSBjcmVhdGVcdTAwMWJbMG0lMEEgIFx1MDAxYlszM21+XHUwMDFiWzBtIHVwZGF0ZSBpbi1wbGFjZVx1MDAxYlswbSUwQVx1MDAxYlszMW0tXHUwMDFiWzBtL1x1MDAxYlszMm0rXHUwMDFiWzBtIGRlc3Ryb3kgYW5kIHRoZW4gY3JlYXRlIHJlcGxhY2VtZW50XHUwMDFiWzBtJTBBJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnJvbGVbXCJBV1NfREVGQVVMVF9SRUdJT05cIl1cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkJTBBXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwicm9sZVwiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSAgICAgID0gXCJhd3MtY29udHJvbFwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc2VjcmV0X25hbWUgICAgID0gXCJBV1NfREVGQVVMVF9SRUdJT05cIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHVwZGF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5yb2xlW1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZCUwQVx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInJvbGVcIiB7JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gY3JlYXRlZF9hdCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlcG9zaXRvcnkgICAgICA9IFwiYXdzLXMzLWNvbnRyb2xcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHNlY3JldF9uYW1lICAgICA9IFwiQVdTX0RFRkFVTFRfUkVHSU9OXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEFcdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQucm9sZVtcIkFXU19ST0xFXCJdXHUwMDFiWzBtIG11c3QgYmUgXHUwMDFiWzFtXHUwMDFiWzMxbXJlcGxhY2VkXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzMxbS1cdTAwMWJbMG0vXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInJvbGVcIiB7JTBBICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gY3JlYXRlZF9hdCAgICAgID0gXCIyMDIzLTAzLTE5IDIyOjMwOjUwICswMDAwIFVUQ1wiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSBcImF3cy1zMy1jb250cm9sOkFXU19ST0xFXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpIFx1MDAxYlszMW0jIGZvcmNlcyByZXBsYWNlbWVudFx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHVwZGF0ZWRfYXQgICAgICA9IFwiMjAyMy0wMy0xOSAyMjozMDo1MCArMDAwMCBVVENcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICBcdTAwMWJbOTBtIyAoMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgIH0lMEElMEFcdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQucm9sZVtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXVx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWQlMEFcdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJyb2xlXCIgeyUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGNyZWF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXBvc2l0b3J5ICAgICAgPSBcImdpdGh1Yi1jb250cm9sXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXRfbmFtZSAgICAgPSBcIkFXU19ERUZBVUxUX1JFR0lPTlwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdXBkYXRlZF9hdCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwb1x1MDAxYlswbSB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEFcdTAwMWJbMG0gIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImdpdGh1Yi1jb250cm9sXCIlMEEgICAgICAgIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICA9IFwiZ2l0aHViLWNvbnRyb2xcIiUwQSAgICAgICAgXHUwMDFiWzkwbSMgKDMzIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG0lMEElMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB0ZW1wbGF0ZSB7JTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGluY2x1ZGVfYWxsX2JyYW5jaGVzID0gZmFsc2UlMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gb3duZXIgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2U4XCIlMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSAgICAgICAgICAgPSBcInRlcnJhZm9ybS10ZW1wbGF0ZVwiJTBBICAgICAgICB9JTBBJTBBICAgICAgICBcdTAwMWJbOTBtIyAoMSB1bmNoYW5nZWQgYmxvY2sgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbSUwQSAgICB9JTBBJTBBXHUwMDFiWzFtUGxhbjpcdTAwMWJbMG0gNCB0byBhZGQsIDEgdG8gY2hhbmdlLCAxIHRvIGRlc3Ryb3kuJTBBXHUwMDFiWzBtXHUwMDFiWzkwbSUwQVx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MDAxYlswbSUwQSUwQVNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuJTBBJTBBVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6JTBBICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiUwQVxuOjpkZWJ1Zzo6c3RkZXJyOiBcbjo6ZGVidWc6OmV4aXRjb2RlOiAwXG4iLCAic3RkZXJyIjogIiIsICJhZGQiOiA0LCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiAxfX0=```
</p></details>